#include <stdio.h>
#pragma warning(disable:4996)
#include <stdbool.h>  //声明bool
#include <stdlib.h>

//#include <minmax.h>               //内置minmax函数库
#include "max.h"                    //自定函数库

int main()
{

/********************** 探究bool类型 *************************
	bool flag;
	flag = true;
	//printf("%d", flag);
****************************************************************/



/************************* switch用法 ****************************
	int grade;
	printf("Enter a grade:");
	scanf("%d", &grade);                 //错误:%d 而不是$d
	printf("grade is %d:",grade);
	switch (grade)
	{
	case 10: printf("emm");              //break;
	case 9: printf("emm");
	}
****************************************************************/



/******************** 大小比较优化：导入函数 *******************
	int a, b,c;
	//scanf("%d%d", &a, &b);
	scanf("%d,%d,%d", &a, &b,&c);

	//int m = max(a, b);
	int m = maxx(a, b,c);
	printf("max=%d", m);
****************************************************************/



/******************** 眼瞎 *******************

	printf("\?*&\\!_\/\/\\a@\\\\\\r\\n!\/\/\\\\\"_\"\/\\\\^!~zZ>");

*********************************************/




/******************** 向上取整 *******************

	float i, j, a, b;
	int c,d;
	scanf("%f%f", &i, &j);
	a = i / j;
	b = int((i + j) / j);
	c = a;
	d = b;
	if (a<b && a>c)
	{

		printf("%d", d);
	}
	else
	{

		printf("%.0f", a);
	}
*********************************************/



/*********** 算利润 （存钱，利率） ***********

	float a, b, s;
	scanf("%f %f", &a, &b);
	s = a * (1 + b/100);
	printf("%.2f", s);

*********************************************/



/******************** 向上取整 *******************

	int i, j, k;
	i = 2;
	j = 3;
	k = i * j == 6;
	printf("%d", k);
*********************************************/



/*********** 随机数实验（未成功） ***********

	int i = 0;
	while (true)
	{
		i = rand();
		printf("%d\n", i);
	}
*********************************************/










	return 0;
}

