#include <stdio.h>
#pragma warning(disable:4996)

//有bug
/****************************************************************
int main() 
{
	int a, b, c;
	scanf("%d,%d,%d", &a, &b, &c);
	int sum;
	printf("%d", sum);
	return a > b ? a : b;
}
****************************************************************/






/***************************************************************
int main()										//摄氏度华氏度转换(已完成)
{
	float c, f;
	printf("press the celsius:");
	scanf("%f", &c);
	f = c * 1.8f + 32;
	printf("%f", f);
	return 0;
}
****************************************************************/



/************************计算3个数字的最大值 ***************************************
int main() {
	int a, b, c;
	scanf("%d,%d,%d", &a, &b, &c);
	//printf("%d+%d+%d\n", a, b, c);
	if (a > b)
	{
		//printf("%d+%d+%d", a, b, c);
		if (a > c)
		{
			printf("max=%d", a);
		}
		else
		{
			printf("max=%d", c);

		}
	}
	else
	{
		if (b>c)
		{
			printf("max=%d", b);

		}
		else
		{
			printf("max=%d", c);

		}
	}
	return 0;
}
***************************************************************/



//简单的if判断
/***************************************************************
#include"stdio.h"
int main(void)
{
	int  x;
	int y = 2, z = 3;
	scanf("%d", &x);
	if (x == y + z)
	{
		printf("*****");

	}
	else
	{
		printf("#####");

	}
	return 0;
}
***************************************************************/







/***********************计算圆球体积***************************
#define FORT (4.0f/3.0f)
int main()
{
	float r,v;
	scanf("%f", &r);
	v = 3.1415926f * r * r * r * FORT;
	printf("%f", v);
}
***************************************************************/





